# CreateRibbonPanel Method (Tab, String) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIApplication..::..CreateRibbonPanel Method (Tab, String)
UIApplication Class See Also
---
Create a new RibbonPanel on the designated standard Revit tab.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
```

Visual Basic
---
```text
Public Overridable Function CreateRibbonPanel ( _
	tab As Tab, _
	panelName As String _
) As RibbonPanel
```

Visual C++
---
```text
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
)
```

# ### Parameters
tab
    Type: Autodesk.Revit.UI..::..TabThe target tab, on which the new panel will be created.
panelName
    Type: System..::..StringThe name of the panel to be created.
# Remarks
This method will create a custom panel appending to the specified tab. This method is not supported in Macros.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | panelName is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | panelName is Empty or the tab is not valid. |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | If more than 100 panels were created or the tab cannot be found. |

# See Also
UIApplication Class
CreateRibbonPanel Overload
Autodesk.Revit.UI Namespace